In [75]:
import pandas as pd
import numpy as np

 # Pandas Serileri

In [76]:
seri=pd.Series([1,2,3,4,5]) # serinin değerleri ve index değerleri bir arada verilir
seri

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [77]:
type(seri)

pandas.core.series.Series

In [78]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [79]:
seri.ndim

1

In [80]:
seri.values

array([1, 2, 3, 4, 5], dtype=int64)

In [81]:
seri.head(2) # elemanları baştan kaç tane 
seri.tail(3)

2    3
3    4
4    5
dtype: int64

In [82]:
pd.Series([14,45,55,78],index=[1,3,5,7])

1    14
3    45
5    55
7    78
dtype: int64

In [83]:
pd.Series([14,45,55,78],index=["a","b","c","d"])

a    14
b    45
c    55
d    78
dtype: int64

In [84]:
sozluk=pd.Series({"reg":10,"Del":15})

In [85]:
sozluk

reg    10
Del    15
dtype: int64

In [86]:
pd.concat([seri,seri])

0    1
1    2
2    3
3    4
4    5
0    1
1    2
2    3
3    4
4    5
dtype: int64

In [87]:
seri.index

RangeIndex(start=0, stop=5, step=1)

In [88]:
list(seri.items())

[(0, 1), (1, 2), (2, 3), (3, 4), (4, 5)]

In [89]:
seri**5

0       1
1      32
2     243
3    1024
4    3125
dtype: int64

``` Pandas DataFrame Olusturma ```

In [90]:
myList=[1,7,8,15,45,75,45]

In [91]:
pd.DataFrame(myList,columns=["Degisken_Ismı"])

   Degisken_Ismı
0              1
1              7
2              8
3             15
4             45
5             75
6             45

In [92]:
import numpy as np
m=np.arange(0,9).reshape(3,3)

In [93]:
df=pd.DataFrame(m,columns=["Var1","Var2","Var3"])

In [94]:
df.head()

   Var1  Var2  Var3
0     0     1     2
1     3     4     5
2     6     7     8

In [95]:
df.columns=("deg1","deg2","deg3")

In [96]:
df

   deg1  deg2  deg3
0     0     1     2
1     3     4     5
2     6     7     8

In [97]:
type(df)

pandas.core.frame.DataFrame

In [98]:
df.shape

(3, 3)

In [99]:
df.values

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [100]:
df.loc[0]

deg1    0
deg2    1
deg3    2
Name: 0, dtype: int32

In [101]:
df["deg2"]

0    1
1    4
2    7
Name: deg2, dtype: int32

In [102]:
myArray=np.random.normal(5,11,size=(3,3))

In [103]:
dataArray=pd.DataFrame(myArray,index=["Dogukan","Serdar","Mehmet"],columns=["A Data","B Data","C Data"])

In [104]:
dataArray

            A Data     B Data     C Data
Dogukan   8.332782   9.598656   8.503564
Serdar  -16.791228  -8.070045   3.957654
Mehmet    6.709698 -23.709086 -13.928002

In [105]:
dataArray["D Data"]=dataArray["A Data"]+dataArray["C Data"]

In [106]:
dataArray

            A Data     B Data     C Data     D Data
Dogukan   8.332782   9.598656   8.503564  16.836346
Serdar  -16.791228  -8.070045   3.957654 -12.833574
Mehmet    6.709698 -23.709086 -13.928002  -7.218305

In [107]:
dataArray.loc["Dogukan"]

A Data     8.332782
B Data     9.598656
C Data     8.503564
D Data    16.836346
Name: Dogukan, dtype: float64

In [108]:
dataArray.loc["Dogukan"]["A Data"]

8.332781908247554

In [109]:
dataArray.loc["Dogukan","B Data"]

9.598656062478042

In [110]:
dataArray[dataArray>0]

           A Data    B Data    C Data     D Data
Dogukan  8.332782  9.598656  8.503564  16.836346
Serdar        NaN       NaN  3.957654        NaN
Mehmet   6.709698       NaN       NaN        NaN

In [111]:
dataArray.reset_index()

     index     A Data     B Data     C Data     D Data
0  Dogukan   8.332782   9.598656   8.503564  16.836346
1   Serdar -16.791228  -8.070045   3.957654 -12.833574
2   Mehmet   6.709698 -23.709086 -13.928002  -7.218305

In [112]:
newIndex=["Dogkn","Srdr","Mhmt"]

In [116]:
dataArray["new"]=newIndex

In [117]:
dataArray.set_index("new")

          A Data     B Data     C Data     D Data
new
Dogkn   8.332782   9.598656   8.503564  16.836346
Srdr  -16.791228  -8.070045   3.957654 -12.833574
Mhmt    6.709698 -23.709086 -13.928002  -7.218305

In [118]:
dataArray

            A Data     B Data     C Data     D Data    new
Dogukan   8.332782   9.598656   8.503564  16.836346  Dogkn
Serdar  -16.791228  -8.070045   3.957654 -12.833574   Srdr
Mehmet    6.709698 -23.709086 -13.928002  -7.218305   Mhmt

In [126]:
firstIndex=["Ankara","Ankara","Ankara","Bursa","Bursa","Bursa"]
secondIndex=["Mert","Ferdi","Koray","Derin","Jale","Can"]
myList1=[[10,"A"],[15,"B"],[16,"C"],[17,"D"],[18,"E"],[19,"F"]]
mergeIndex=list(zip(firstIndex,secondIndex))

mergeIndex=pd.MultiIndex.from_tuples(mergeIndex)

myList=np.array(mergeIndex)

In [127]:
dataFrameIndex=pd.DataFrame(data=myList1,index=mergeIndex,columns=["Age","Jobs"])

In [128]:
dataFrameIndex

              Age Jobs
Ankara Mert    10    A
       Ferdi   15    B
       Koray   16    C
Bursa  Derin   17    D
       Jale    18    E
       Can     19    F

In [133]:
dataFrameIndex.loc["Ankara"]

       Age Jobs
Mert    10    A
Ferdi   15    B
Koray   16    C

In [134]:
dataFrameIndex.loc["Ankara"].loc["Koray"]

Age     16
Jobs     C
Name: Koray, dtype: object